/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *   ____ _
 *  / ___| |__   __ _  ___  ___
 * | |   | '_ \ / _` |/ _ \/ __|
 * | |___| | | | (_| | (_) \__ \
 *  \____|_| |_|\__,_|\___/|___/
 *
 *  https://github.com/yingzhuo/chaos
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
package com.github.yingzhuo.chaos.id;

import java.util.HashMap;
import java.util.Map;

/**
 * @author 应卓
 * @since 0.0.1
 */
public enum Area {

    北京市(
            E.put("东城区", 110101),
            E.put("西城区", 110102),
            E.put("崇文区", 110103),
            E.put("宣武区", 110104),
            E.put("朝阳区", 110105),
            E.put("丰台区", 110106),
            E.put("石景山区", 110107),
            E.put("海淀区", 110108),
            E.put("门头沟区", 110109),
            E.put("房山区", 110111),
            E.put("通州区", 110112),
            E.put("顺义区", 110113),
            E.put("昌平区", 110114),
            E.put("大兴区", 110115),
            E.put("怀柔区", 110116),
            E.put("平谷区", 110117),
            E.put("密云县", 110228),
            E.put("延庆县", 110229)
    ),

    上海市(
            E.put("黄浦区", 310101),
            E.put("卢湾区", 310103),
            E.put("徐汇区", 310104),
            E.put("长宁区", 310105),
            E.put("静安区", 310106),
            E.put("普陀区", 310107),
            E.put("闸北区", 310108),
            E.put("虹口区", 310109),
            E.put("杨浦区", 310110),
            E.put("闵行区", 310112),
            E.put("宝山区", 310113),
            E.put("嘉定区", 310114),
            E.put("浦东新区", 310115),
            E.put("金山区", 310116),
            E.put("松江区", 310117),
            E.put("青浦区", 310118),
            E.put("奉贤区", 310120),
            E.put("崇明县", 310230)
    ),

    天津市(
            E.put("和平区", 120101),
            E.put("河东区", 120102),
            E.put("河西区", 120103),
            E.put("南开区", 120104),
            E.put("河北区", 120105),
            E.put("红桥区", 120106),
            E.put("东丽区", 120110),
            E.put("西青区", 120111),
            E.put("津南区", 120112),
            E.put("北辰区", 120113),
            E.put("武清区", 120114),
            E.put("宝坻区", 120115),
            E.put("宁河县", 120221),
            E.put("静海县", 120223),
            E.put("蓟　县", 120225)
    ),

    重庆市(
            E.put("万州区", 500101),
            E.put("涪陵区", 500102),
            E.put("渝中区", 500103),
            E.put("大渡口区", 500104),
            E.put("江北区", 500105),
            E.put("沙坪坝区", 500106),
            E.put("九龙坡区", 500107),
            E.put("南岸区", 500108),
            E.put("北碚区", 500109),
            E.put("万盛区", 500110),
            E.put("双桥区", 500111),
            E.put("渝北区", 500112),
            E.put("巴南区", 500113),
            E.put("黔江区", 500114),
            E.put("长寿区", 500115),
            E.put("江津区", 500116),
            E.put("合川区", 500117),
            E.put("永川区", 500118),
            E.put("南川区", 500119),
            E.put("綦江县", 500222),
            E.put("潼南县", 500223),
            E.put("铜梁县", 500224),
            E.put("大足县", 500225),
            E.put("荣昌县", 500226),
            E.put("璧山县", 500227),
            E.put("梁平县", 500228),
            E.put("城口县", 500229),
            E.put("丰都县", 500230),
            E.put("垫江县", 500231),
            E.put("武隆县", 500232),
            E.put("忠县", 500233),
            E.put("开县", 500234),
            E.put("云阳县", 500235),
            E.put("奉节县", 500236),
            E.put("巫山县", 500237),
            E.put("巫溪县", 500238),
            E.put("石柱土家族自治县", 500240),
            E.put("秀山土家族苗族自治县", 500241),
            E.put("酉阳土家族苗族自治县", 500242),
            E.put("彭水苗族土家族自治县", 500243)
    ),

    河北省(
            // 石家庄市
            E.put("长安区", 130102),
            E.put("桥东区", 130103),
            E.put("桥西区", 130104),
            E.put("新华区", 130105),
            E.put("井陉矿区", 130107),
            E.put("裕华区", 130108),
            E.put("井陉县", 130121),
            E.put("正定县", 130123),
            E.put("栾城县", 130124),
            E.put("行唐县", 130125),
            E.put("灵寿县", 130126),
            E.put("高邑县", 130127),
            E.put("深泽县", 130128),
            E.put("赞皇县", 130129),
            E.put("无极县", 130130),
            E.put("平山县", 130131),
            E.put("元氏县", 130132),
            E.put("赵县", 130133),
            E.put("辛集市", 130181),
            E.put("藁城市", 130182),
            E.put("晋州市", 130183),
            E.put("新乐市", 130184),
            E.put("鹿泉市", 130185),

            // 唐山市
            E.put("路南区", 130202),
            E.put("路北区", 130203),
            E.put("古冶区", 130204),
            E.put("开平区", 130205),
            E.put("丰南区", 130207),
            E.put("丰润区", 130208),
            E.put("滦县", 130223),
            E.put("滦南县", 130224),
            E.put("乐亭县", 130225),
            E.put("迁西县", 130227),
            E.put("玉田县", 130229),
            E.put("唐海县", 130230),
            E.put("遵化市", 130281),
            E.put("迁安市", 130283),

            // 秦皇岛市
            E.put("海港区", 130302),
            E.put("山海关区", 130303),
            E.put("北戴河区", 130304),
            E.put("青龙满族自治县", 130321),
            E.put("昌黎县", 130322),
            E.put("抚宁县", 130323),
            E.put("卢龙县", 130324),

            // 邯郸市
            E.put("邯郸市", 130400),
            E.put("市辖区", 130401),
            E.put("邯山区", 130402),
            E.put("丛台区", 130403),
            E.put("复兴区", 130404),
            E.put("峰峰矿区", 130406),
            E.put("邯郸县", 130421),
            E.put("临漳县", 130423),
            E.put("成安县", 130424),
            E.put("大名县", 130425),
            E.put("涉县", 130426),
            E.put("磁县", 130427),
            E.put("肥乡县", 130428),
            E.put("永年县", 130429),
            E.put("邱县", 130430),
            E.put("鸡泽县", 130431),
            E.put("广平县", 130432),
            E.put("馆陶县", 130433),
            E.put("魏县", 130434),
            E.put("曲周县", 130435),
            E.put("武安市", 130481),

            // 邢台市
            E.put("桥东区", 130502),
            E.put("桥西区", 130503),
            E.put("邢台县", 130521),
            E.put("临城县", 130522),
            E.put("内丘县", 130523),
            E.put("柏乡县", 130524),
            E.put("隆尧县", 130525),
            E.put("任县", 130526),
            E.put("南和县", 130527),
            E.put("宁晋县", 130528),
            E.put("巨鹿县", 130529),
            E.put("新河县", 130530),
            E.put("广宗县", 130531),
            E.put("平乡县", 130532),
            E.put("威　县", 130533),
            E.put("清河县", 130534),
            E.put("临西县", 130535),
            E.put("南宫市", 130581),
            E.put("沙河市", 130582),

            // 保定市
            E.put("新市区", 130602),
            E.put("北市区", 130603),
            E.put("南市区", 130604),
            E.put("满城县", 130621),
            E.put("清苑县", 130622),
            E.put("涞水县", 130623),
            E.put("阜平县", 130624),
            E.put("徐水县", 130625),
            E.put("定兴县", 130626),
            E.put("唐县", 130627),
            E.put("高阳县", 130628),
            E.put("容城县", 130629),
            E.put("涞源县", 130630),
            E.put("望都县", 130631),
            E.put("安新县", 130632),
            E.put("易县", 130633),
            E.put("曲阳县", 130634),
            E.put("蠡县", 130635),
            E.put("顺平县", 130636),
            E.put("博野县", 130637),
            E.put("雄县", 130638),
            E.put("涿州市", 130681),
            E.put("定州市", 130682),
            E.put("安国市", 130683),
            E.put("高碑店市", 130684),

            // 张家口市
            E.put("桥东区", 130702),
            E.put("桥西区", 130703),
            E.put("宣化区", 130705),
            E.put("下花园区", 130706),
            E.put("宣化县", 130721),
            E.put("张北县", 130722),
            E.put("康保县", 130723),
            E.put("沽源县", 130724),
            E.put("尚义县", 130725),
            E.put("蔚县", 130726),
            E.put("阳原县", 130727),
            E.put("怀安县", 130728),
            E.put("万全县", 130729),
            E.put("怀来县", 130730),
            E.put("涿鹿县", 130731),
            E.put("赤城县", 130732),
            E.put("崇礼县", 130733),

            // 承德市
            E.put("双桥区", 130802),
            E.put("双滦区", 130803),
            E.put("鹰手营子矿区", 130804),
            E.put("承德县", 130821),
            E.put("兴隆县", 130822),
            E.put("平泉县", 130823),
            E.put("滦平县", 130824),
            E.put("隆化县", 130825),
            E.put("丰宁满族自治县", 130826),
            E.put("宽城满族自治县", 130827),
            E.put("围场满族蒙古族自治县", 130828),

            // 沧州市
            E.put("新华区", 130902),
            E.put("运河区", 130903),
            E.put("沧县", 130921),
            E.put("青县", 130922),
            E.put("东光县", 130923),
            E.put("海兴县", 130924),
            E.put("盐山县", 130925),
            E.put("肃宁县", 130926),
            E.put("南皮县", 130927),
            E.put("吴桥县", 130928),
            E.put("献县", 130929),
            E.put("孟村回族自治县", 130930),
            E.put("泊头市", 130981),
            E.put("任丘市", 130982),
            E.put("黄骅市", 130983),
            E.put("河间市", 130984),

            // 廊坊市
            E.put("安次区", 131002),
            E.put("广阳区", 131003),
            E.put("固安县", 131022),
            E.put("永清县", 131023),
            E.put("香河县", 131024),
            E.put("大城县", 131025),
            E.put("文安县", 131026),
            E.put("大厂回族自治县", 131028),
            E.put("霸州市", 131081),
            E.put("三河市", 131082),

            // 衡水市
            E.put("桃城区", 131102),
            E.put("枣强县", 131121),
            E.put("武邑县", 131122),
            E.put("武强县", 131123),
            E.put("饶阳县", 131124),
            E.put("安平县", 131125),
            E.put("故城县", 131126),
            E.put("景县", 131127),
            E.put("阜城县", 131128),
            E.put("冀州市", 131181),
            E.put("深州市", 131182)
    ),

    山西省(
            // 太原市
            E.put("小店区", 140105),
            E.put("迎泽区", 140106),
            E.put("杏花岭区", 140107),
            E.put("尖草坪区", 140108),
            E.put("万柏林区", 140109),
            E.put("晋源区", 140110),
            E.put("清徐县", 140121),
            E.put("阳曲县", 140122),
            E.put("娄烦县", 140123),
            E.put("古交市", 140181),

            // 大同市
            E.put("南郊区", 140211),
            E.put("新荣区", 140212),
            E.put("阳高县", 140221),
            E.put("天镇县", 140222),
            E.put("广灵县", 140223),
            E.put("灵丘县", 140224),
            E.put("浑源县", 140225),
            E.put("左云县", 140226),
            E.put("大同县", 140227),

            // 阳泉市
            E.put("阳泉市", 140300),
            E.put("城区", 140302),
            E.put("矿区", 140303),
            E.put("郊区", 140311),
            E.put("平定县", 140321),
            E.put("盂县", 140322),

            // 长治市
            E.put("长治县", 140421),
            E.put("襄垣县", 140423),
            E.put("屯留县", 140424),
            E.put("平顺县", 140425),
            E.put("黎城县", 140426),
            E.put("壶关县", 140427),
            E.put("长子县", 140428),
            E.put("武乡县", 140429),
            E.put("沁县", 140430),
            E.put("沁源县", 140431),
            E.put("潞城市", 140481),

            // 晋城市
            E.put("沁水县", 140521),
            E.put("阳城县", 140522),
            E.put("陵川县", 140524),
            E.put("泽州县", 140525),
            E.put("高平市", 140581),
            E.put("朔州市", 140600),
            E.put("市辖区", 140601),
            E.put("朔城区", 140602),
            E.put("平鲁区", 140603),
            E.put("山阴县", 140621),
            E.put("应县", 140622),
            E.put("右玉县", 140623),
            E.put("怀仁县", 140624),

            // 晋中市
            E.put("榆次区", 140702),
            E.put("榆社县", 140721),
            E.put("左权县", 140722),
            E.put("和顺县", 140723),
            E.put("昔阳县", 140724),
            E.put("寿阳县", 140725),
            E.put("太谷县", 140726),
            E.put("祁　县", 140727),
            E.put("平遥县", 140728),
            E.put("灵石县", 140729),
            E.put("介休市", 140781),

            // 运城市
            E.put("盐湖区", 140802),
            E.put("临猗县", 140821),
            E.put("万荣县", 140822),
            E.put("闻喜县", 140823),
            E.put("稷山县", 140824),
            E.put("新绛县", 140825),
            E.put("绛县", 140826),
            E.put("垣曲县", 140827),
            E.put("夏县", 140828),
            E.put("平陆县", 140829),
            E.put("芮城县", 140830),
            E.put("永济市", 140881),
            E.put("河津市", 140882),

            // 忻州市
            E.put("忻府区", 140902),
            E.put("定襄县", 140921),
            E.put("五台县", 140922),
            E.put("代　县", 140923),
            E.put("繁峙县", 140924),
            E.put("宁武县", 140925),
            E.put("静乐县", 140926),
            E.put("神池县", 140927),
            E.put("五寨县", 140928),
            E.put("岢岚县", 140929),
            E.put("河曲县", 140930),
            E.put("保德县", 140931),
            E.put("偏关县", 140932),
            E.put("原平市", 140981),

            // 临汾市
            E.put("尧都区", 141002),
            E.put("曲沃县", 141021),
            E.put("翼城县", 141022),
            E.put("襄汾县", 141023),
            E.put("洪洞县", 141024),
            E.put("古县", 141025),
            E.put("安泽县", 141026),
            E.put("浮山县", 141027),
            E.put("吉县", 141028),
            E.put("乡宁县", 141029),
            E.put("大宁县", 141030),
            E.put("隰县", 141031),
            E.put("永和县", 141032),
            E.put("蒲县", 141033),
            E.put("汾西县", 141034),
            E.put("侯马市", 141081),
            E.put("霍州市", 141082),

            // 吕梁市
            E.put("吕梁市", 141100),
            E.put("市辖区", 141101),
            E.put("离石区", 141102),
            E.put("文水县", 141121),
            E.put("交城县", 141122),
            E.put("兴县", 141123),
            E.put("临县", 141124),
            E.put("柳林县", 141125),
            E.put("石楼县", 141126),
            E.put("岚县", 141127),
            E.put("方山县", 141128),
            E.put("中阳县", 141129),
            E.put("交口县", 141130),
            E.put("孝义市", 141181),
            E.put("汾阳市", 141182)
    ),

    内蒙古自治区(
            // 呼和浩特市
            E.put("新城区", 150102),
            E.put("回民区", 150103),
            E.put("玉泉区", 150104),
            E.put("赛罕区", 150105),
            E.put("土默特左旗", 150121),
            E.put("托克托县", 150122),
            E.put("和林格尔县", 150123),
            E.put("清水河县", 150124),
            E.put("武川县", 150125),

            // 包头市
            E.put("东河区", 150202),
            E.put("昆都仑区", 150203),
            E.put("青山区", 150204),
            E.put("石拐区", 150205),
            E.put("白云鄂博矿区", 150206),
            E.put("九原区", 150207),
            E.put("土默特右旗", 150221),
            E.put("固阳县", 150222),
            E.put("达尔罕茂明安联合旗", 150223),
            E.put("乌海市", 150300),
            E.put("市辖区", 150301),
            E.put("海勃湾区", 150302),
            E.put("海南区", 150303),
            E.put("乌达区", 150304),

            // 赤峰市
            E.put("红山区", 150402),
            E.put("元宝山区", 150403),
            E.put("松山区", 150404),
            E.put("阿鲁科尔沁旗", 150421),
            E.put("巴林左旗", 150422),
            E.put("巴林右旗", 150423),
            E.put("林西县", 150424),
            E.put("克什克腾旗", 150425),
            E.put("翁牛特旗", 150426),
            E.put("喀喇沁旗", 150428),
            E.put("宁城县", 150429),
            E.put("敖汉旗", 150430),

            // 通辽市
            E.put("科尔沁区", 150502),
            E.put("科尔沁左翼中旗", 150521),
            E.put("科尔沁左翼后旗", 150522),
            E.put("开鲁县", 150523),
            E.put("库伦旗", 150524),
            E.put("奈曼旗", 150525),
            E.put("扎鲁特旗", 150526),
            E.put("霍林郭勒市", 150581),

            // 鄂尔多斯市
            E.put("东胜区", 150602),
            E.put("达拉特旗", 150621),
            E.put("准格尔旗", 150622),
            E.put("鄂托克前旗", 150623),
            E.put("鄂托克旗", 150624),
            E.put("杭锦旗", 150625),
            E.put("乌审旗", 150626),
            E.put("伊金霍洛旗", 150627),

            // 呼伦贝尔市
            E.put("海拉尔区", 150702),
            E.put("阿荣旗", 150721),
            E.put("莫力达瓦达斡尔族自治旗", 150722),
            E.put("鄂伦春自治旗", 150723),
            E.put("鄂温克族自治旗", 150724),
            E.put("陈巴尔虎旗", 150725),
            E.put("新巴尔虎左旗", 150726),
            E.put("新巴尔虎右旗", 150727),

            // 满洲里市
            E.put("满洲里市", 150781),
            E.put("牙克石市", 150782),
            E.put("扎兰屯市", 150783),
            E.put("额尔古纳市", 150784),
            E.put("根河市", 150785),

            // 巴彦淖尔市
            E.put("临河区", 150802),
            E.put("五原县", 150821),
            E.put("磴口县", 150822),
            E.put("乌拉特前旗", 150823),
            E.put("乌拉特中旗", 150824),
            E.put("乌拉特后旗", 150825),
            E.put("杭锦后旗", 150826),

            // 乌兰察布市
            E.put("集宁区", 150902),
            E.put("卓资县", 150921),
            E.put("化德县", 150922),
            E.put("商都县", 150923),
            E.put("兴和县", 150924),
            E.put("凉城县", 150925),
            E.put("察哈尔右翼前旗", 150926),
            E.put("察哈尔右翼中旗", 150927),
            E.put("察哈尔右翼后旗", 150928),
            E.put("四子王旗", 150929),
            E.put("丰镇市", 150981),

            // 兴安盟
            E.put("乌兰浩特市", 152201),
            E.put("阿尔山市", 152202),
            E.put("科尔沁右翼前旗", 152221),
            E.put("科尔沁右翼中旗", 152222),
            E.put("扎赉特旗", 152223),
            E.put("突泉县", 152224),
            E.put("锡林郭勒盟", 152500),
            E.put("二连浩特市", 152501),
            E.put("锡林浩特市", 152502),
            E.put("阿巴嘎旗", 152522),
            E.put("苏尼特左旗", 152523),
            E.put("苏尼特右旗", 152524),
            E.put("东乌珠穆沁旗", 152525),
            E.put("西乌珠穆沁旗", 152526),
            E.put("太仆寺旗", 152527),
            E.put("镶黄旗", 152528),
            E.put("正镶白旗", 152529),
            E.put("正蓝旗", 152530),
            E.put("多伦县", 152531),
            E.put("阿拉善盟", 152900),
            E.put("阿拉善左旗", 152921),
            E.put("阿拉善右旗", 152922),
            E.put("额济纳旗", 152923)
    ),
    辽宁省(
            // 沈阳市
            E.put("和平区", 210102),
            E.put("沈河区", 210103),
            E.put("大东区", 210104),
            E.put("皇姑区", 210105),
            E.put("铁西区", 210106),
            E.put("苏家屯区", 210111),
            E.put("东陵区", 210112),
            E.put("沈北新区", 210113),
            E.put("于洪区", 210114),
            E.put("辽中县", 210122),
            E.put("康平县", 210123),
            E.put("法库县", 210124),
            E.put("新民市", 210181),

            // 大连市
            E.put("中山区", 210202),
            E.put("西岗区", 210203),
            E.put("沙河口区", 210204),
            E.put("甘井子区", 210211),
            E.put("旅顺口区", 210212),
            E.put("金州区", 210213),
            E.put("长海县", 210224),
            E.put("瓦房店市", 210281),
            E.put("普兰店市", 210282),
            E.put("庄河市", 210283),

            // 鞍山市
            E.put("鞍山市", 210300),
            E.put("市辖区", 210301),
            E.put("铁东区", 210302),
            E.put("铁西区", 210303),
            E.put("立山区", 210304),
            E.put("千山区", 210311),
            E.put("台安县", 210321),
            E.put("岫岩满族自治县", 210323),
            E.put("海城市", 210381),

            // 抚顺市
            E.put("新抚区", 210402),
            E.put("东洲区", 210403),
            E.put("望花区", 210404),
            E.put("顺城区", 210411),
            E.put("抚顺县", 210421),
            E.put("新宾满族自治县", 210422),
            E.put("清原满族自治县", 210423),

            // 本溪市
            E.put("平山区", 210502),
            E.put("溪湖区", 210503),
            E.put("明山区", 210504),
            E.put("南芬区", 210505),
            E.put("本溪满族自治县", 210521),
            E.put("桓仁满族自治县", 210522),

            // 丹东市
            E.put("元宝区", 210602),
            E.put("振兴区", 210603),
            E.put("振安区", 210604),
            E.put("宽甸满族自治县", 210624),
            E.put("东港市", 210681),
            E.put("凤城市", 210682),

            // 锦州市
            E.put("古塔区", 210702),
            E.put("凌河区", 210703),
            E.put("太和区", 210711),
            E.put("黑山县", 210726),
            E.put("义县", 210727),
            E.put("凌海市", 210781),
            E.put("北镇市", 210782),

            // 营口市
            E.put("站前区", 210802),
            E.put("西市区", 210803),
            E.put("鲅鱼圈区", 210804),
            E.put("老边区", 210811),
            E.put("盖州市", 210881),
            E.put("大石桥市", 210882),

            // 阜新市
            E.put("海州区", 210902),
            E.put("新邱区", 210903),
            E.put("太平区", 210904),
            E.put("清河门区", 210905),
            E.put("细河区", 210911),
            E.put("阜新蒙古族自治县", 210921),
            E.put("彰武县", 210922),

            // 辽阳市
            E.put("白塔区", 211002),
            E.put("文圣区", 211003),
            E.put("宏伟区", 211004),
            E.put("弓长岭区", 211005),
            E.put("太子河区", 211011),
            E.put("辽阳县", 211021),
            E.put("灯塔市", 211081),

            // 盘锦市
            E.put("双台子区", 211102),
            E.put("兴隆台区", 211103),
            E.put("大洼县", 211121),
            E.put("盘山县", 211122),

            // 铁岭市
            E.put("银州区", 211202),
            E.put("清河区", 211204),
            E.put("铁岭县", 211221),
            E.put("西丰县", 211223),
            E.put("昌图县", 211224),
            E.put("调兵山市", 211281),

            // 开原市
            E.put("双塔区", 211302),
            E.put("龙城区", 211303),
            E.put("朝阳县", 211321),
            E.put("建平县", 211322),
            E.put("喀喇沁左翼蒙古族自治县", 211324),
            E.put("北票市", 211381),
            E.put("凌源市", 211382),

            // 葫芦岛市
            E.put("连山区", 211402),
            E.put("龙港区", 211403),
            E.put("南票区", 211404),
            E.put("绥中县", 211421),
            E.put("建昌县", 211422),
            E.put("兴城市", 211481)
    ),

    吉林省(
            // 长春市
            E.put("南关区", 220102),
            E.put("宽城区", 220103),
            E.put("朝阳区", 220104),
            E.put("二道区", 220105),
            E.put("绿园区", 220106),
            E.put("双阳区", 220112),
            E.put("农安县", 220122),
            E.put("九台市", 220181),
            E.put("榆树市", 220182),
            E.put("德惠市", 220183),

            // 吉林市
            E.put("昌邑区", 220202),
            E.put("龙潭区", 220203),
            E.put("船营区", 220204),
            E.put("丰满区", 220211),
            E.put("永吉县", 220221),
            E.put("蛟河市", 220281),
            E.put("桦甸市", 220282),
            E.put("舒兰市", 220283),
            E.put("磐石市", 220284),

            // 四平市
            E.put("铁西区", 220302),
            E.put("铁东区", 220303),
            E.put("梨树县", 220322),
            E.put("伊通满族自治县", 220323),
            E.put("公主岭市", 220381),
            E.put("双辽市", 220382),

            // 辽源市
            E.put("龙山区", 220402),
            E.put("西安区", 220403),
            E.put("东丰县", 220421),
            E.put("东辽县", 220422),

            // 通化市
            E.put("东昌区", 220502),
            E.put("二道江区", 220503),
            E.put("通化县", 220521),
            E.put("辉南县", 220523),
            E.put("柳河县", 220524),
            E.put("梅河口市", 220581),
            E.put("集安市", 220582),

            // 白山市
            E.put("八道江区", 220602),
            E.put("江源区", 220605),
            E.put("抚松县", 220621),
            E.put("靖宇县", 220622),
            E.put("长白朝鲜族自治县", 220623),
            E.put("临江市", 220681),

            // 松原市
            E.put("宁江区", 220702),
            E.put("前郭尔罗斯蒙古族自治县", 220721),
            E.put("长岭县", 220722),
            E.put("乾安县", 220723),
            E.put("扶余县", 220724),
            E.put("白城市", 220800),
            E.put("市辖区", 220801),
            E.put("洮北区", 220802),
            E.put("镇赉县", 220821),
            E.put("通榆县", 220822),
            E.put("洮南市", 220881),
            E.put("大安市", 220882),

            // 延边朝鲜族自治州
            E.put("延吉市", 222401),
            E.put("图们市", 222402),
            E.put("敦化市", 222403),
            E.put("珲春市", 222404),
            E.put("龙井市", 222405),
            E.put("和龙市", 222406),
            E.put("汪清县", 222424),
            E.put("安图县", 222426)
    );

    private Area(E... entries) {
        this.map = new HashMap<>();
        for (Map.Entry<String, Integer> entry : entries) {
            this.map.put(entry.getKey(), entry.getValue());
        }
    }

    private Map<String, Integer> map;

    private static class E implements Map.Entry<String, Integer> {

        public static E put(String name, Integer code) {
            final E e = new E();
            e.name = name;
            e.code = code;
            return e;
        }

        private String name;
        private Integer code;

        @Override
        public String getKey() {
            return this.name;
        }

        @Override
        public Integer getValue() {
            return this.code;
        }

        @Override
        public Integer setValue(Integer value) {
            throw new UnsupportedOperationException();
        }
    }
}
